export const messages = {
    header:{
        title: "கிரெசென்ட் பிரியாணி",
        contact: "ஆர்டர் செய்ய அழைத்திடுங்கள் - 87436485845"
    },
    body:{
        md:{
            info: "ஆன்லைனில் ஆர்டர் செய்ய எங்கள் மொபைல் ஆப் பதிவிறக்கம் செய்யுங்கள்"
        }
    },
    select:{
        default: "தேர்ந்தெடுங்கள்"
    },
    processing:{
        inprogress: "காத்திருங்கள்"
    },
    welcome:{
        prefix: "வணக்கம்",
        default: "வாடிக்கையாளரே"
    },
    orders:{
        button: "ஆர்டர்கள்"
    },
    errors:{
        "500":({named})=>`${named('errorid') === undefined
            ? 'தடங்கலுக்கு மன்னிக்கவும். மீண்டும் முயற்சி செய்க அல்லது எங்களை தொடர்பு கொள்க: 8438931322'
            : 'தடங்கலுக்கு மன்னிக்கவும். மீண்டும் முயற்சி செய்க அல்லது எங்களை தொடர்பு கொள்க: 8438931322, கோளாறு எண் : '+named('errorid')}`,
        "403":"கூகிள் வழியாக உள்நுழையுங்கள்!",
        "401":"அனுமதி இல்லை, கூகிள் வழியாக மீண்டும் உள்நுழைந்து முயற்சி செய்து பாருங்கள்!" 
    },
    validations:{
        required: "{property} உள்ளிடுக",
        invalid: "{property} தவறானது",
        minLength: "{property} குறைந்தபட்ச நீளம் {length}",
        maxLength: "{property} அதிகபட்ச நீளம் {length}"
    },
    product:{
        none: "இந்த கிளை இன்னும் செயல்பாட்டுக்கு வரவில்லை",
        dcharge: "டெலிவரி கட்டணம்",
        addAddress: "முகவரி"
    },
    cart:{
        place: "ஆர்டர் செய்ய"
    },
    user:{
        info: "உங்களின் முகவரி/மொபைல் எண் விவரங்கள் இல்லை. ஆர்டர் செய்யுமுன் இந்த விவரங்களை பதிவிடுங்கள்",
        header: "விவரங்கள்",
        mobileNo: "மொபைல் எண்",
        name: "பெயர்"
    },
    address:{
        header: "முகவரி",
        address: "முகவரி",
        pincode: "அஞ்சல் எண்"
    },
    currency:{
        rs: "ரூ."
    },
    buttons:{
        save: "சேமி"
    }
}
